import numpy as np

A = np.array([[1, 2], [3, 4]])  # 定义二维数组A
B = np.array([[5, 6], [7, 8]])  # 定义二维数组B

C1 = A - B  # A、B两个数组元素之间相减,结果赋给变量C1
C2 = A + B  # A、B两个数组元素之间相加,结果赋给变量C2
C3 = A * B  # A、B两个数组元素之间相乘,结果赋给变量C3
C4 = A / B  # A、B两个数组元素之间相除,结果赋给变量C4
C5 = A / 3  # A数组所有元素除以3,结果赋给变量C5
C6 = 1 / A  # 1除以A数组所有元素,结果赋给变量C6
C7 = A ** 2  # A数组所有元素取平方,结果赋给变量C7
C8 = np.array([1, 2, 3, 3.1, 4.5, 6, 7, 8, 9])  # 定义数组C8
C9 = (C8 - min(C8)) / (max(C8) - min(C8))  # 对C8中的元素做极差化处理,结果赋给变量C9
D = np.array([[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]])  # 定义数组D
# 数学运算
E1 = np.sqrt(D)  # 对数组D中所有元素取平方根,结果赋给变量E1
E2 = np.abs([1, 2, 100])  # 取绝对值
E3 = np.cos([1, 2, 3])  # 取cos值
E4 = np.sin(D)  # 取sin值
E5 = np.exp(D)  # 取指数函数值
