# 1. 存储菜架数据
source = {
    '紫贝天葵': {'最低价': 6.50, '平均价': 6.75, '最高价': 7.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '金丝南瓜': {'最低价': 7.50, '平均价': 7.75, '最高价': 8.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '鱼腥草叶': {'最低价': 8.00, '平均价': 8.70, '最高价': 9.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '鱼腥草根': {'最低价': 6.50, '平均价': 6.75, '最高价': 7.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '圣女果': {'最低价': 3.50, '平均价': 3.75, '最高价': 4.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '荷兰豆': {'最低价': 8.00, '平均价': 8.70, '最高价': 9.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '朝天椒': {'最低价': 18.00, '平均价': 19.00, '最高价': 20.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '绿菜花': {'最低价': 1.80, '平均价': 1.90, '最高价': 2.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'},
    '球茎茴香': {'最低价': 7.50, '平均价': 7.75, '最高价': 8.00, '规格': '特菜', '单位': '斤', '发布日期': '2019-06-10'}
}

# 2. 提取朝天椒的今日最高价, 查找出鱼腥草叶的均价
print("朝天椒最高价：%f" % source.get("朝天椒").get("最高价"))
print("鱼腥草叶均价：%f" % source.get("鱼腥草叶").get("平均价"))

# 3.
if '红尖椒' not in source:
    source.update({'红尖椒': {'最低价': 5.00, '平均价': 5.75, '最高价': 5.50}})
else:
    print(source.values())

# 4.
if '红尖椒' in source:
    source.pop('红尖椒')
# 5.
sum = 0
for i in source:
    sum += source.get(i).get('最高价')
print(sum / len(source))

# 6.

print((source.get('荷兰豆').get('最高价') + source.get('荷兰豆').get('最低价')) / 2)
